//#include <stdio.h>
//
//int main()
//{
//    printf("hello, my name is ji hoon");
//
//    return 0;
//}

//#include는 c언어에서 <>안에 있는 헤더파일(.h)을 포함한다.
//명령을 처리하는 키워드.

//1. 헤더파일(header file)또는 인클루드 파일(include file)은
//여러 기능을 모아놓은 파일로 확장자명이 (.h) 임.

//2.키워드(keyward) : c언어에서 특정기능을 진행하기위해 설정한 32개의 영단어를 의미.


//주석(comment) 프로그램 코드에 영향을 주지않고 메모만 남기는 용도
//코드 작성시 주석이 많이 필요한 설계는 좋지않음!

//함수(funtion) : 특정 하나의 명령을 수행하기위해 명령문들을 모아놓은 집합체
// 함수의 이름() {}의 형태를 가지고 있다.

// printf ();는 콘솔 창에 작성한 내용을 출력하는 기능.
//()안에는 큰따옴표 ("")작성하고 ()안에는 작성할 내용을 적는다.


//3. return은 함수를 종료하는 키워드. return 다음에 값을적으면 그값이 
//함수를 호출한 위치쪽으로 전달됨; 

//main 함수는 1개;
