//#include "Header.h"
////입력한 숫자가 짝수인지 아닌지를 판단하는 프로그램
//int main()
//{
//	int num;
//	printf("정수입력\n");
//	scanf("%d", &num);
//	//ex)if문작성시 if 안의 명령문이 1개일경우 {}를 생략할수있다;
//	//ex2>
//
//	if (num%2==0) 
//		printf("짝수입니다\n");
//	else
//		printf("짝수가 아닙니다\n");
//
//	//ex2>삼항연산자 활용
//	//조건?조건 이 맞을경우 실행할 작업 : 조건이 틀릴경우 
//	//조건이 둘중 하나로 결정되는 경우 if문을 대신해 사용가능
//	num%2==0 ? printf("짝수입니다\n") : printf("짝수가 아닙니다\n");
//
//	return 0;
//
//
//}
///*
//ex 답안
//
//    int num;
//	printf("정수입력\n");
//	scanf("%d", &num);
//
//	if (num%2==0) {
//		printf("짝수입니다\n");
//
//	}
//	else
//	{
//		printf("짝수가 아닙니다\n");
//	}
//	return 0;
//	
//	
//	굿!
//	
//*/